import Breadcrumb from "../breadcrumb/Breadcrumb";

export default function History() {

    return (
        <div className="mx-auto max-w-2xl lg:max-w-4xl mt-5 mb-15">
            <Breadcrumb />
            <h2 className="text-2xl/20 ">ИСТОРИЯ НА ТАЕКУОН-ДО</h2>
            <p className="mb-4">Историята на ТаеКуон-До, не може да бъде разказана без да споменем личната история на признатия за баща на модерното ТаеКуон-До, създател и президент на Международната ТаеКуон-До Федерация (ITF), генерал Чой Хонг Хи. Поради неговите неуморни усилия и неотслабваща преданост към ТаеКуон-До, в момента то се ползва с такава голяма популярност в света.</p>

            <div className="flex justify-center mb-8">
                <img
                    src="https://falcontaekwon-do.com/imgs/genchoi1918.jpg"
                    alt="General Choi Hong Hi"
                    className="rounded-2xl shadow-lg"
                />
            </div>

            <p className="mb-4">Генерал Чой Хонг Хи е роден на 9-ти Ноември 1918 година в скалистата и пуста местност на Хуа Дае, на областта Мион Чун в сегашна КНДР. Като малък той е бил крехък и доста болнав, непрекъснат източник на тревоги за неговите родители.</p>

            <p className="mb-4">Дори и в ранно детство бъдещият генерал показвал здрав дух непоколебимост. Дванадесет годишен той бил изключен от училище за агитация срещу Японската власт, която контролирала Корея от 1910 до 1945.</p>

            <p className="mb-4">След завършване на училище, Чой е изпратен от своя баща да учи калиграфия при Хан Ил Донг, един от най-известните учители в Корея. Хан освен калиграф бил и майстор по Те Кион. Виждайки слабото здраве на своя ученик, наред със заниманията по калиграфия, учителят започва да укрепва тялото на Чой със строгите упражнения от Те Кион.</p>

            <p className="mb-4">През 1937 година, Чой е изпратен в Киото, Япония за да продължи обучението си. Там той среща своя сънародник Ким, който преподавал Карате. След две години усилени тренировки Чой става носител на черен пояс по Карате. Поради това техниките от Карате и Те Кион са в основата на съвременното ТаеКуон-До.</p>

            <p className="mb-4">Със започването на Втората Световна Война, Чой е принуден да постъпи в Японската армия. Докато е на пост в Пхенян, Северна Корея, Чой бива въвлечен като член на Корейското движение за независимост, познато още като Движение на Пхенянските студенти войни и е затворен в Японския затвор. Докато е в затвора, Чой борейки се със скуката започва да поддържа своята физическа форма, като продължава да тренира своето изкуство. Скоро неговите съкилийници стават негови ученици, а след известно време целият затвор се превръща в тренировъчна зала.</p>

            <p className="mb-4">След седем години затвор, през август 1945 година Чой е освободен. През януари следващата година Чой получава назначение от новата Южно Корейска армия в звание младши лейтенант. Скоро бива назначен като командир на подразделенията в Куан Джу. Там младшият лейтенант започва да обучава войниците на своето подразделение на бойното изкуство ТаеКуон-До.</p>

            <p className="mb-4">След получаването на званието лейтенант, той се отправя към Тае Джон, за да командва Втори пехотен полк.</p>

            <p className="mb-4">През 1947 година е повишен: в началото на капитан, а след това - майор. През 1948 година е изпратен в Сеул на длъжност началник по придвижването и снабдяването на войските. Там той става инструктор на американската школа на военната полиция. В края на 1948 година Чой получава званието подполковник.</p>

            <p className="mb-4">През 1949 година му се присъжда званието полковник. През тази година той за първи път пребивава в САЩ във висшата офицерска школа Рейл, където демонстрира пред американците техниката на своето бойно изкуство.</p>

            <p className="mb-4">На остров Че Джу, Чой организира ударната 29-та пехотна дивизия, която след време става авангарда на съвременното ТаеКуон-До. В базата на дивизията бил създаден спортен клуб О До Куон, в който се готвели не само инструкторските кадри за армията, но и се развивала системата на съвременното ТаеКуон-До на базата на Те Кион и Карате. В края на 1954 година Чой става генерал-майор.</p>

            <p className="mb-4">През 1955 година ТаеКуон-До получава своето официално признание като бойно изкуство в Корея. Свикана била специална комисия от водещи майстори, инструктори, историци и известни деятели на републиката. Разглеждали се няколко варианта относно наименованието на новия вид бойно изкуство. На 11 април свиканата от генерал Чой комисия приела предложеното название ТаеКуон-До. Това название заменило множество противоречиви термини, като: Танг Су, Конг Су, Те Кион, Куон Боп и други.</p>

            <p className="mb-4">През 1959 година ТаеКуон-До се разпростира извън границите на Корея. Бащата на ТаеКуон-До и деветнадесет от неговите черни пояси, тръгват да разпространяват новото бойно изкуство с голям успех, поразявайки всички с превъзходните и прецизни техники. Също така през 1959 Чой бива избран на два знатни поста: Президент на новоформиралата се Корейска ТаеКуон-До Асоциация и заместник командир на 2-ра армия в Тае Гу. За Вицепрезиденти на Корейска ТаеКуон-До Асоциация (КТА) са избрани Ро Бионг Джик от бойното изкуство Сонг Му Куан и Йон Куе Бионг от Джи До Куан, а Хуанг Кий от Му Дук Куан е избран за изпълнителен директор.</p>

            <p className="mb-4">1960 година отбелязва бързо разпространение и популярност на ТаеКуон-До не само в Корея, но и в много страни по света. Първият демонстрационен отбор по ТаеКуон-До се е състоял от майсторите Хан Ча Кио, Ким Джунг Кеун, Парк Джунг Су и Куон Дже Хуа, които популяризирали новото бойно изкуство в девет страни. Това послужило като основа за създаването на Международната ТаеКуон-До Федерация (ITF), както е позната днес. На 22 март 1966 Международната Федерация по ТаеКуон-До е създадена в Сеул с участието на Виетнам, Малайзия, Сингапур, Западна Германия, САЩ, Турция, Италия, Египет и Корея.</p>

            <p className="mb-4">През 1972, Генерал Чой премества седалището на Международната ТаеКуон-До Федерация с единодушно съгласие на членуващите страни в Торонто, Канада, имайки предвид да разпростре това изкуство във всички страни по света. През 1985 бащата на ТаеКуон-До подсилва своето желание да разпростре неговото изкуство по целия свят, особено в третия свят и в политически непривилегированите държави, с преместване седалището на Международната ТаеКуон-До Федерация във Виена, Австрия, където все още се намира. През живота си, най-голямото желание на Генерал Чой е да даде своето бойно изкуство на всички хора, без значение тяхната раса, религия или политическа принадлежност. С възникването на ITF, виждането на Генерал Чой за установяването на ТаеКуон-До като световна неполитическа организация и бойно изкуство, не просто спорт, става реалност.</p>

            <p className="mb-4">Генерал Чой изказва своето становище в книгата си "ТаеКуон-До": "Всички неща се управляват от закона на Ин и Ян, светлината и мрака ... щастието често може да бъде помрачено от катастрофални моменти ... Моят живот беше бурен, загадка със самотни битки и злополучни приключения на които не може да се завиди ... живот на самоизгнание на хиляди мили от любимата ми страна. Е въпреки това си заслужаваше старанието ...</p>

            <p className="mb-4">... Моята мечта беше осъществена ... най-накрая успях да разпространявам и преподавам ТаеКуон-До без да има значение от религия, идеология, национална принадлежност или раса. Без колебание мога да кажа, че аз съм най-щастливият човек."</p>

        </div>
    );
}
