export default function Theory() {

    return (
        <div className="mx-auto max-w-2xl lg:max-w-4xl mt-5 mb-15">
            <div className="mb-6 text-sm text-gray-600">
                <span>Home</span>
                <span className="mx-2">/</span>
                <span>Terminology</span>
            </div>
            <h2 className="text-3xl mt-10 font-semibold">Теория на силата</h2>
            <h2 className="text-2xl/15 my-0 text-blue-600">(Хим Уи Уоли)</h2>
            <p className="mb-4 indent-8">Начинаещите биха попитали: “Откъде човек черпи силата, необходима за постигането на смайващите резултати, с които е известно Таекуон-до?”. Тази сила е резултат от използването на цялостния личен потенциал чрез математическото прилагане на техниките на Таекуон-до. Средностатистическият човек използва само 10-20% от своя потенциал. Всеки, независимо от ръст, възраст или пол, може да изпълни поразяващи техники, в които да използва 100% от своя потенциал. Въпреки, че тренировките със сигурност водят до постигането на добра физическа кондиция, не винаги чрез тях се придобива изключителна енергия и свръхчовешка сила. По-важно е, че тренировките по Таекуон-до водят до по-високо ниво на силата на реакция, концентрация, баланс, контрол на дишането и бързина. Това са факторите, които обуславят голяма физическа сила.
            </p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Сила на реакцията (Бандонг Рьок)</h2>
            <p className="mb-4 indent-8">Според закона на Нютън всяка сила създава равна на себе си противосила. Когато една кола се блъсне със сила 2 000 паунда, стената ще противодейства със сила 2000 паунда, или ако се сложи на единия край на една дървена люлка тежест от 1 тон, другата страна на люлката ще излети със същата сила. Ако Вашият противник се втурне срещу Вас с висока скорост, даже и най-лекият удар, с който ще го ударите по главата, ще бъде равен на неговата собствена сила, с която той се удря плюс силата на Вашия юмрук. Комбинацията от двете сили взети заедно, неговата, която е голяма, и вашата, която е малка, е доста впечатляваща. Друга сила на реакцията е Вашата собствена. Ударът с десния юмрук е по-силен, ако левият е прибран до бедрото.
            </p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Концентрация (Джип Джунг)</h2>
            <p className="mb-2 indent-8">Като приложите силата на въздействието върху възможно най-малък участък, това ще концентрира силата и по този начин ще увеличи нейния ефект. Например, силата на водата, която тече от маркуч е по-голяма, ако отвора на маркуча е по-малък. Обратното, тежестта на човек, разпределена на обувки за ски, не оставя следи върху снега.
            </p>
            <p className="mb-4 indent-8">Ударите в Таекуон-до често се нанасят с края на отворената длан или със свивката на пръстите. Много важно е да не изразходвате силата си в началото, а постепенно, и особено в тази част, където се осъществява контакт с тялото на противника, силата трябва да бъде така концентрирана така, че да доведе до поразяващ удар. По-ясно казано, колкото по-малко е времето за концентрация, толкова по-голяма ще е силата на удара. Изисква се изключителна концентрация, за да се мобилизира веднага всеки мускул на тялото върху най-малка площ. В заключение, концентрацията се постига по два начина: единият е да се концентрира всеки мускул на тялото, особено по-големите мускули на бедрото и коремната област (които теоретично са по-бавни от по-малките мускули в другите части на тялото), така че да се използва съответното оръжие в съответното време; вторият начин е да се концентрират така мобилизираните мускули върху жизнено важно за противника място. Ето защо бедрата и коремната област се изнасят леко странично или вертикално при всяко едно движение, независимо дали е при атака или отбрана.</p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Баланс (Кюн Хюнг)</h2>
            <p className="mb-4 indent-8">Балансът е изключително важен във всяка дисциплина в атлетиката. В Таекуон-до той заслужава специално внимание. Като поддържаш тялото си винаги в равновесие, тоест, добре балансирано, ударът е по-ефективен и поразяващ. И обратно, небалансираното тяло е много по-нестабилно. Стойката трябва да бъде винаги стабилна и лесно подвижна и при нападението, и при отбраната. Балансът се класифицира едновременно и като динамична, и като статична стабилност. Те са толкова взаимосвързани, че максимална сила може да се произведе само когато статичната стабилност се поддържа чрез динамичната. За да се поддържа добър баланс, центърът на тежестта на изправеното тяло трябва да пада под права линия по средата между двата крака, или в центъра на единия крак, ако е необходимо цялата маса на тежестта на тялото да бъде концентрирана в единия крак. Центърът на тежестта може да се променя според тежестта на тялото. Подвижността и коляното също са важни при поддържане на баланса и при бързата атака, и при бързото възстановяване от удар. Петата на задния крак не трябва никога да се отделя от земята при точката на въздействие. Това е необходимо не само, за да се поддържа добър баланс, но и за да се произведе максимална сила в точката на въздействие.
            </p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Контрол на дишането (Хохoп Джийюл)</h2>
            <p className="mb-2 indent-8">Контролираното дишане въздейства не само на енергията и бързината на даден човек, но може да доведе до такова състояние на тялото, че то да приеме даден удар и да увеличи силата на удара, насочен срещу противника. Спирането на дишане при издишване в критичен момент при удар може да предотврати загубата на съзнание и да омекоти болката. Силното издишване в момент на въздействие и спирането на дишането при произвеждане на движението стяга коремната област, за да концентрира максимум усилия в насочването на движението, докато бавното издишване помага при подготовката на следващото движение. Едно важно правило, което трябва да бъде запомнено: никога не трябва да се вдишва докато нанасяте удар срещу противник. Това не само ще попречи на движението, но и ще доведе до загуба на сила.
            </p>
            <p className="mb-4 indent-8">Учениците трябва да се упражняват да прикриват дишането си, за да не показват никакви външни признаци на умора. Опитният боец със сигурност ще атакува, когато разбере, че противникът му е на ръба на изтощението. Едно вдишване и издишване трябва да бъде направено за едно движение, когато има поредица от движения.
            </p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Маса (Зилянг)</h2>
            <p className="mb-2 indent-8">Според математическите теории максимум кинетична енергия или сила се получава от максимална тежест на тялото и скоростта. Тежестта на тялото трябва да бъде увеличена в момента на нанасяне на удара. Няма съмнение, че максимална тежест на тялото се постига с движение при завъртане на бедрото. Големите коремни мускули се извиват, за да осигурят допълнителна телесна сила. Така бедрото се върти в същата посока, като тази на повърхността, с която се атакува или блокира. Друг начин за увеличаване на тежестта на тялото е чрез пружиниране в ставата на коляното. Това се постига като бавно се повдига бедрото в началото на движението и се свали в момента на въздействие, за да може тежестта на тялото да премине в движението.
            </p>
            <p className="mb-4 indent-8">В заключение необходимо е да се подчертае, че принципите на силата изброени по-горе са толкова достоверни днес, в нашата съвременна научна и ядрена ера, както са били и преди векове. Истинската сила, извираща от малкото човешко тяло със сигурност е впечатляваща.
            </p>

            <h2 className="text-xl mt-10 mb-3 font-medium">Скорост (Сокдо)</h2>
            <p className="mb-2 indent-8">Скоростта е най-същественият фактор, формиращ силата и мощта. Научно силата е равна на масата, умножена по ускорението (F=MA) или (P=MV2) Според теорията на кинетичната енергия, всеки обект увеличава теглото си, както и скоростта си при падане. Този принцип се прилага единствено при това изкуство за самозащита. По тази причина в момента на въздействието позицията на ръката се разполага по ниско от рамото, а позицията на крака се разполага по-ниско от бедрото, докато тялото е във въздуха.
            </p>
            <p className="mb-4 indent-8">Силата на ответния удар, дишането, контролът, балансът, концентрацията и отпускането на мускулите не трябва да се пренебрегват. Това са факторите, които допринасят за скоростта и всички те, заедно с гъвкавите и ритмични движения, трябва да бъдат добре координирани, за да се произведе максимум сила в Таекуон-до.
            </p>

        </div>
    );
}
